---
title: 新版特性
---

# 介绍
平台1.0已经开发完成1年多时间，已完成项目60多个，未来2年还有300多个项目要使用框架开发，暴露出来的问题越发明显:

- 只覆盖功能开发不够，客户期望：移动端开发、接口开发、流程开发、规则设置，仓储布局设计，大屏仪表盘，打印模板。都想要管理起来；
- 产品的报价越来越低，实施人员不够用,客户也有非常强烈的意愿，希望有自己的主导权，自己定制界面、流程、打印、大屏、规则、接口，需要的框架更加灵活；
- 案例库，随着项目越来越多，没有集中的地方来展示我们的项目案例。框架，最好能提供功能，能够把其他项目的各种特性借鉴进来；

### 新版框架
- PC端功能重构
- 进入无代码模式：功能模块放进数据库，客户自助开发功能
- 重构二开组件源码
- 重磅功能：
    - 移动端开发
    - 大屏仪表盘开发
    - 流程开发
    - 布局设计开发
    - 规则开发
    - 计划任务设计
    - 接口平台

### 移动端二次开发 （已完成）

![[Pasted image 20240315130739.png]]
![[Pasted image 20240315130753.png]]
![[Pasted image 20240315130805.png]]
![[Pasted image 20240315130809.png]]

### 大屏二次开发 (预计2024-05-01完成)

![[Pasted image 20240315130817.png]]

![[Pasted image 20240315130822.png]]

### 决策规则设计
- 待完善调试
- 待完善算法对接
- 待完善决策表
- 待完善评分卡
- 待完善运行日志
- 待完善统计分析
- 预计2024-04-01完成

![[Pasted image 20240315130936.png]]

### 计划任务管理
- 预计2024-05-01完成
![[Pasted image 20240315131018.png]]

![[Pasted image 20240315131024.png]]

### PC端用户设置、保存客户布局
- 已完成表格组件
- 待完善Form表单
- 待完善list列表组件
- 待完善甘特图组件
- 待完善统计图组件
- 待完善地图组件
- 待完善布局保存
- 预计2024-06-01可使用

![[Pasted image 20240315131051.png]]
![[Pasted image 20240315131055.png]]
![[Pasted image 20240315131059.png]]

### 流程设计
- 待完善接口平台对接
- 待完善工作流方法扫描
- 待完善日志和调试
- 待完善工作流图形版本控制
- 待完善定时任务组件
- 待完善审批流组件
- 预计2024-04-01可使用

![[Pasted image 20240315131109.png]]

### 仓储布局设计
- 待完善基础数据对接
- 待完善动画
- 待完善颜色状态
- 预计2024-11-01可使用

![[Pasted image 20240315131120.png]]

### 接口设计 (预计2024-04-01完成)

### 打印报表设计 (预计2024-10-01完成)

### 案例库保存 (预计2024-10-01完成)
